In [6]:
# API 
Application programming Interface
(1)Web Application - 
(2)Machine Learning Model-

Build Interface

In [4]:
import pandas as pd
df = pd.read_csv("../c37/hiring.csv")
df.columns = ["experience","test_score","interview_score","salary"]
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [5]:
# I am creating a dummy project project so that we can deploy this
# Salary prediction
# Linear Regression

In [6]:
df.shape

(8, 4)

In [7]:
df.isnull().sum()

experience         2
test_score         1
interview_score    0
salary             0
dtype: int64

In [8]:
df.experience.fillna(0,inplace=True)
df.test_score.fillna(df.test_score.mean(),inplace=True)

In [9]:
df.isnull().sum()

experience         0
test_score         0
interview_score    0
salary             0
dtype: int64

In [10]:
df

  experience  test_score  interview_score  salary
0          0    8.000000                9   50000
1          0    8.000000                6   45000
2       five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   72000
7     eleven    7.000000                8   80000

In [11]:
def conv_dict(x):
    dict={
        "five":5,
        "two":2,
        "seven":7,
        "three":3,
        "ten":10,
        "eleven":11,
        0:0
    }
    return dict[x]

In [12]:
df.experience = df.experience.apply(conv_dict)

In [13]:
df

   experience  test_score  interview_score  salary
0           0    8.000000                9   50000
1           0    8.000000                6   45000
2           5    6.000000                7   60000
3           2   10.000000               10   65000
4           7    9.000000                6   70000
5           3    7.000000               10   62000
6          10    7.857143                7   72000
7          11    7.000000                8   80000

In [14]:
X = df.iloc[:,:-1]
X

   experience  test_score  interview_score
0           0    8.000000                9
1           0    8.000000                6
2           5    6.000000                7
3           2   10.000000               10
4           7    9.000000                6
5           3    7.000000               10
6          10    7.857143                7
7          11    7.000000                8

In [15]:
y = df.iloc[:,-1]
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary, dtype: int64

In [16]:
# I am not doing train and test split here, but in real ML model make sure you do it

In [17]:
from sklearn.linear_model import LinearRegression

In [18]:
lr = LinearRegression()
lr

LinearRegression()

In [19]:
lr.fit(X,y)#training a model

LinearRegression()

In [20]:
lr.predict([[3,6,7]])

C:\Users\AKASH\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([52576.68782509])

In [21]:
lr.predict([[3,6,7]])

C:\Users\AKASH\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([52576.68782509])

# Pickle

In [23]:
import pickle
pickle.dump(lr,open("lr_c39.pkl","wb"))
#

In [1]:
lr.predict([[3,6,7]])

NameError: name 'lr' is not defined

In [1]:
import pickle
lr = pickle.load(open("lr_c39.pkl","rb"))

In [6]:
lr.predict([[130,16,17]])

C:\Users\AKASH\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([452785.34475071])

In [ ]:
52576.68782509

In [ ]:
52576.687825094275